/*6. Користувач вводить три довжини сторін трикутника (використовуйте prompt () три рази для введення кожної сторони).
Необхідно 
	a) визначити і вивести в консоль площу трикутника 
	b) перевірити чи цей трикутник є прямокутним і вивести в консоль результат перевірки.
Здійснювати перевірку чи введені користувачем значення коректні, в іншому випадку вивести 'Incorrect data‘.
 Результат обчислення площі трикутника виводити в консоль з точністю 3 знаки після коми (наприклад:  8.42355465 =>  8.424). */

    const a = +prompt("Enter number a");
    const b = +prompt("Enter number b");
    const c = +prompt("Enter number c");
 
   

    if(isNaN(a) || isNaN(b) || isNaN(c) || a===0 || b===0 ||c==0) {
	alert("Incorrect data");
    }

     const p = (a+b+c)/2;
    const s = (p*(p-a)*(p-b)*(p-c))**(1/2);
    if(isNaN(s)){
	    alert("Incorrect data")
    }

    if (a*a==b*b+c*c || b*b==a*a+c*c || c*c==a*a+b*b){
   console.log("Цей трикутник є прямокутним ")
    }

console.log(`Площа трикутника  ${s.toFixed(3)}`);
