/*
3. Створіть порожній масив;
1) У перший елемент масиву запишіть будь-яке число;
2) У другий елемент масиву запишіть будь-який рядок;
3) У третій елемент масиву запишіть будь-яке логічне значення;
4) У четвертий елемент масиву запишіть значення null;
5) Виведіть на екран число елементів, яке зберігається в масиві;
6) Запитайте у користувача ввести будь-яке значення і запишіть це значення в п'ятий елемент масиву;
7) Виведіть на екран п'ятий елемент масиву.
8) Видаліть 1-ий елемент масиву і виведіть масив на екран.

*/

let myArray = [];

myArray[0] = 15;
myArray[1] = "Java Script for TA";
myArray[2] = true;
myArray[3] = null;

document.write(myArray.length);
document.write(`</p>`);

myArray[4] = prompt("Enter any value");

document.write(myArray[4]);
document.write(`</p>`);

myArray.shift();

document.write(myArray);
document.write(`</p>`);